{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "float32", "output_dim": 128, "trainable": true, "embeddings_regularizer": null, "input_dim": 24503, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 100], "activity_regularizer": null, "input_length": 100}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_1", "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_2", "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}